---
type: TriangulatedShellComponent
namespace: Autodesk.Revit.DB
version: 2024
members: 9
tags: [revit-api, class]
---

# TriangulatedShellComponent

`Autodesk.Revit.DB.TriangulatedShellComponent` · Revit 2024 · 9 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Clear | 2013 | `public void Clear ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetTriangle | 2013 | `public TriangleInShellComponent GetTriangle ( int triangleIndex )` |
| Method | GetVertex | 2013 | `public XYZ GetVertex ( int vertexIndex )` |
| Method | GetVertices | 2023 | `public IList < XYZ > GetVertices ()` |
| Property | IsClosed | 2013 | `public bool IsClosed { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | TriangleCount | 2013 | `public int TriangleCount { get ; }` |
| Property | VertexCount | 2013 | `public int VertexCount { get ; }` |